#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Calendar
#+STARTUP: showall
#+PROPERTY: filename
  :PROPERTIES:
  :Name: /home/deerpig/proj/chenla/prolog/prolog-calendar.org
  :Created: 2017-03-19T12:15@Prek Leap (11.642600N-104.919210W)
  :ID: a86b365b-b90f-4879-96f4-a6647ae2abaa
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.02"
  RES='git log $TAG...HEAD --pretty="<li>%s</li>\n" -- (file-name-nondirectory (buffer-file-name))'
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

* Introduction

The Scopic Calendar is a collection of rituals, festivals
and conventions that are practiced by members of a scopic
arc.  

  - Rituals
    - winding the clock
    - tile laying ceremony
    - island building ceremony
  - Convox
    - Decade
    - Century
    - Millenia
    - Special  
  - Elections
    - Abbot  
    - 
  - Stages of Life
    - birth
    - coming of age
    - anthem
    - apprentice
    - journeyman
    - master
    - marriage
    - divorce
    - death : preparation of the body, wake, funeral,
      cremation, three month, one year.
  - Seasons & Microseasons
  - Festival
    - Solstice
    - New Years & Festival of Fools
    - Water Festival
    - Harvest Festival
    - Founding Day
    - Saunts
  - Symbols


Microseasons!
The Chinese 1-day per page -- almanack-calendar is where we
want to go with this...
